README.org
#+title: Advent-of-code
#+subtitle: 2020

* =main.rs=
  Om niet te veel opnieuw te schrijven zorg ik voor een main die
  redelijk generiek is. Zo hoef ik enkel in een nieuw bestand een
  publieke =solve(lines: Vec<String>)= te schrijven. Via scripts vul
  ik de rest aan. 

** Boilerplate

   #+begin_src rust :tangle src/main.rs
     use std::env;
     use std::fs::File;
     use std::io::{self, BufRead};
     use std::path::Path;

     mod color_validator;
     mod eye_color_validator;
     mod height_validator;
     mod id_validator;
     mod nr_validator;
     
     fn read_lines(filename: &Path) -> io::Result<io::Lines<io::BufReader<File>>> {
	     let file = File::open(filename)?;
	     Ok(io::BufReader::new(file).lines())
     }
   #+end_src

** Main functie
   
   #+begin_src rust :tangle src/main.rs
     // <modules>
     type Solution = fn(Vec<String>) -> (i64, i64);
     fn main() {
	     let args: Vec<String> = env::args().collect();
	     if args.len() != 2 {
		     println!("Geef de dag!");
		     return;
	     }
	     let day = args[1].parse::<usize>().unwrap();
	     if day < 1 {
		     println!("Grapjas");
	     }
	     let p: String = format!("input/{}", day);
	     let path = Path::new(&p);
	     let mut solutions: Vec<Solution> = Vec::new();
	     // <push>
	     let (a1, a2) = solutions[day - 1](
		     read_lines(path)
			     .expect(
				     "geen lijnen",
			     )
			     .collect::<Result<Vec<String>, _>>()
			     .unwrap(),
	     );
	     println!("Eerste: {}\nTweede: {}", a1, a2);
     }
   #+end_src
   
* Aanvullend script

   Nu is er nog een script nodig die onder _modules_ en _push_ de
   correcte modules en functies toevoegt zodat het programma kan
   worden gecompileerd. =cargo build= zou dit script moeten uitvoeren! 

   #+begin_src bash :tangle inject.sh :results verbatim
     for file in src/day*.rs; do
	 file=${file#src/}
	 DAYS=$DAYS:${file%.rs}';';
     done
     shopt -s extglob
     MODS=$(echo $DAYS | sed  's/:/mod /g' | sed 's/;/;\\n/g')
     SOLS=$(echo $DAYS | sed 's/:/solutions.push(/g' | sed 's/;/::solve);\\n/g')
     sed --in-place "s|// <modules>|${MODS}|"  src/main.rs
     sed --in-place "s|// <push>|${SOLS}|" src/main.rs
   #+end_src

   #+RESULTS:


   Als laatste stap moet er een =build.rs= geschreven worden die het
   script zal aanroepen:

   #+begin_src rust :tangle build.rs
      use std::process::Command;

      fn main() {
	      Command::new("bash").args(&["./inject.sh"]).status().unwrap();
      }
   #+end_src
* Day 1

  #+begin_src rust :tangle src/day1.rs
    use std::collections::HashMap;

    fn get_numbers(list: &Vec<i64>, number: i64) -> Result<(i64, i64), String> {
	    let mut map = HashMap::new();
	    for n in list {
		    let diff: i64 = number - n;
		    if diff > 0 {
			    if map.contains_key(&diff) {
				    return Ok((*n, diff));
			    }
			    map.insert(n, diff);
		    }
	    }
	    Err("Geen paar".to_string())
    }

    fn get_trio(list: &Vec<i64>, number: i64) -> Result<(i64, i64, i64), String> {
	    for n in list {
		    if let Ok((x, y)) = get_numbers(&list, number - n) {
			    return Ok((*n, x, y));
		    }
	    }
	    Err("Geen trio".to_string())
    }

    pub fn solve(lines: Vec<String>) -> (i64, i64) {
	    let numbers: Vec<i64> =
		    lines.iter().map(|s| s.parse::<i64>().unwrap()).collect();
	    let res1 = get_numbers(&numbers, 2020).unwrap();
	    let res2 = get_trio(&numbers, 2020).unwrap();
	    (res1.0 * res1.1, res2.0 * res2.1 * res2.2)
    }
  #+end_src

* Day 2
  #+begin_src rust :tangle src/day2.rs
    use regex::Regex;

    #[derive(Default)]
    struct Foo {
	    min: i8,
	    max: i8,
	    c: char,
	    password: String,
    }

    fn is_valid_password1(f: &Foo) -> bool {
	    let freq = f.password.chars().filter(|c| *c == f.c).count() as i8;
	    return f.min <= freq && freq <= f.max;
    }

    fn is_valid_password2(f: &Foo) -> bool {
	    let bool1 = f.password.as_bytes()[(f.min - 1) as usize] as char == f.c;
	    let bool2 = f.password.as_bytes()[(f.max - 1) as usize] as char == f.c;
	    bool1 ^ bool2
    }

    // string is van de vorm :
    // i8-i8 char: String
    fn parse_line(re: &Regex, line: String) -> Option<Foo> {
	    let mut res: Foo = Default::default();
	    let caps = re.captures(&line)?;
	    res.min = caps.get(1)?.as_str().parse::<i8>().unwrap();
	    res.max = caps.get(2)?.as_str().parse::<i8>().unwrap();
	    res.c = caps.get(3)?.as_str().parse::<char>().unwrap();
	    res.password = String::from(caps.get(4)?.as_str());
	    Some(res)
    }

    pub fn solve(lines: Vec<String>) -> (i64, i64) {
	    let re = Regex::new(r"^(\d+)-(\d+) (\w): (\w+)$").unwrap();

	    let mut aantal1 = 0;
	    let mut aantal2 = 0;
	    lines
		    .iter()
		    .map(|line| parse_line(&re, line.to_string()))
		    .for_each(|foo| {
			    if let Some(f) = foo {
				    if is_valid_password1(&f) {
					    aantal1 += 1;
				    }
				    if is_valid_password2(&f) {
					    aantal2 += 1;
				    }
			    }
		    });
	    (aantal1, aantal2)
    }
  #+end_src
* Day 3

  #+begin_src rust :tangle src/day3.rs
    fn count_trees(map: &Vec<Vec<char>>, (a, b): (usize, usize)) -> i64 {
	    let mut x: usize = a;
	    let mut y: usize = b;
	    let mut res = 0;
	    while y < map.len() {
		    if map[y][x] == '#' {
			    res += 1;
		    }
		    x = (x + a) % (map[0].len());
		    y += b;
	    }
	    res
    }

    pub fn solve(lines: Vec<String>) -> (i64, i64) {
		    let slopes = vec![(1, 1), (3, 1), (5, 1), (7, 1), (1, 2)];
		    let mut res: i64 = 1;
		    let vec: Vec<Vec<char>> = lines
			    .into_iter()
			    .map(|line| line.chars().collect())
			    .collect();
		    slopes
			    .iter()
			    .for_each(|slope| res *= count_trees(&vec, *slope));
		    (count_trees(&vec, slopes[1]), res)
    }
  #+end_src
* Day 4
  #+begin_src rust :tangle src/day4.rs :comments link
    use regex::Regex;
    use std::collections::HashMap;

    use crate::color_validator;
    use crate::eye_color_validator;
    use crate::height_validator;
    use crate::id_validator;
    use crate::nr_validator;

    type Passport = HashMap<String, String>;
    fn has_required_fields(p: &Passport) -> bool {
	    let required = vec!["byr", "iyr", "eyr", "hgt", "hcl", "ecl", "pid"];
	    // let optional = vec!["cid"];
	    for r in required {
		    if !p.contains_key(r) {
			    return false;
		    }
	    }
	    true
    }

    fn has_valid_data(p: &Passport) -> bool {
	    for (key, value) in p {
		    let b: bool = match key.as_str() {
			    "byr" => nr_validator::validate(value, 1920, 2002),
			    "iyr" => nr_validator::validate(value, 2010, 2020),
			    "eyr" => nr_validator::validate(value, 2020, 2030),
			    "hgt" => height_validator::validate(value, (150, 193), (56, 79)),
			    "hcl" => color_validator::validate(value),
			    "ecl" => eye_color_validator::validate(value),
			    "pid" => id_validator::validate(value),
			    _ => continue
		    };
		    if !b {
			    return b;
		    }
	    }
	    return true;
    }

    pub fn solve(lines: Vec<String>) -> (i64, i64) {
	    let re = Regex::new("([a-z]+):([a-z#0-9]+)").unwrap();
	    let mut passports: Vec<Passport> = Vec::new();
	    let mut current: Passport = Passport::new();
	    lines.iter().for_each(|line| {
		    if line.eq(&String::from("")) {
			    passports.push(current.clone());
			    current = Passport::new();
		    } else {
			    line.split(" ")
				    .map(|field| re.captures(&field))
				    .collect::<Vec<Option<regex::Captures>>>()
				    .iter()
				    .for_each(|capture| {
					    current.insert(
						    capture
							    .as_ref()
							    .expect("no captures")
							    .get(1)
							    .unwrap()
							    .as_str()
							    .to_string(),
						    capture
							    .as_ref()
							    .expect("no captures")
							    .get(2)
							    .unwrap()
							    .as_str()
							    .to_string(),
					    );
				    });
		    }
	    });
	    passports.push(current.clone());
	    let all_fields = passports
		    .iter()
		    .filter(|p| has_required_fields(p))
		    .collect::<Vec<&Passport>>();
	    let valid_data = passports
		    .iter()
		    .filter(|p| has_required_fields(p) && has_valid_data(p))
		    .collect::<Vec<&Passport>>();
	    (all_fields.len() as i64, valid_data.len() as i64)
    }
  #+end_src
** Validators
*** Numbers

    #+begin_src rust :tangle src/nr_validator.rs :commect link
      pub fn range_validator(s: &String, min: u32, max: u32) -> bool {
	      let n = s.parse::<u32>().unwrap();
	      n >= min && n <= max
      }

      pub fn validate(s: &String, min: u32, max: u32) -> bool {
	      return range_validator(s, min, max);
      }
    #+end_src
*** Heights

    #+begin_src rust :tangle src/height_validator.rs :comments link
      use crate::nr_validator;
      use regex::Regex;

      pub fn validate(s: &String, boundaries_cm: (u32, u32), boundaries_in: (u32, u32)) -> bool {
	      let last_two: String = s.chars().rev().take(2).collect();
	      let re = Regex::new("([0-9]+)[ic][nm]").unwrap();
	      let caps = re.captures(s);
	      if caps.is_none() {
		      return false;
	      }
	      let digit = String::from(caps.unwrap().get(1).unwrap().as_str());
	      if last_two.eq(&String::from("ni")) {
		      nr_validator::range_validator(
			      &digit,
			      boundaries_in.0,
			      boundaries_in.1,
		      )
	      } else {
		      nr_validator::range_validator(
			      &digit,
			      boundaries_cm.0,
			      boundaries_cm.1,
		      )
	      }
      }
    #+end_src
*** Hair Colors

    #+begin_src rust :tangle src/color_validator.rs :comments link
      use regex::Regex;
      fn color_validator(s: &String) -> bool {
	      let color_regex: Regex = Regex::new("#[0-9a-z]{6}").unwrap();
	      color_regex.is_match(s)
      }
      pub fn validate(s: &String) -> bool {
	      color_validator(s)
      }
    #+end_src
*** Eye Colors
    #+begin_src rust :tangle src/eye_color_validator.rs :comments link
      fn eye_color_validator(s: &String) -> bool {
	      let colors = vec!["amb", "blu", "brn", "gry", "grn", "hzl", "oth"];
	      colors.contains(&s.as_str())
      }
      pub fn validate(s: &String) -> bool {
	      eye_color_validator(s)
      }
    #+end_src
*** Pid

    #+begin_src rust :tangle src/id_validator.rs :comments link
      use regex::Regex;
      fn id_validator(s: &String) -> bool {
	      let id_regex = Regex::new("^[0-9]{9}$").unwrap();
	      id_regex.is_match(s)
      }

      pub fn validate(s: &String) -> bool {
	      id_validator(s)
      }
    #+end_src
